export default function () {
  return (
    <div
      className="hidden md:flex items-center cursor-pointer hover:scale-125 transform transition-all mr-4 sm:-ml-2  lg:ml-2 fill-gray-600 dark:text-dark"
      title="管理后台"
      onClick={() => {
        window.open("/admin", "_blank");
      }}
    >
      <svg
        viewBox="0 0 1024 1024"
        version="1.1"
        xmlns="http://www.w3.org/2000/svg"
        p-id="2287"
        width="20"
        height="20"
      >
        <path
          d="M491.392 286.464m-286.464 0a4.476 4.476 0 1 0 572.928 0 4.476 4.476 0 1 0-572.928 0Z"
          p-id="2288"
        ></path>
        <path
          d="M869.312 523.264c-35.392-43.2-101.888-51.2-140.16-10.496-59.648 63.36-143.744 103.232-237.824 103.232-83.264 0-158.976-31.04-216.832-82.048C230.656 495.296 161.856 510.592 129.024 558.976c-49.28 72.768-78.4 160.064-78.4 254.72 0 19.072 1.28 37.76 3.648 56.064C66.176 960.32 150.272 1024 241.536 1024l539.392 0c100.544 0 183.744-77.824 191.232-178.048 0.768-10.624 1.216-21.376 1.216-32.192C973.376 703.296 934.208 602.432 869.312 523.264z"
          p-id="2289"
        ></path>
      </svg>
    </div>
  );
}
